Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: །དགེ་སློང་དག་དེ་ནས་ལྷ་མོ་སྒྱུ་འཕྲུལ་རྟའི་ཤིང་རྟ་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ་བརྒྱད་ཁྲི་བཞི་སྟོང་གིས་ནི་ཀུན་ནས་བསྐོར། གླང་པོ་ཆེའི་ཤིང་རྟ་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་། རྐང་ཏང་དཔའ་ཞིང་རྟུལ་ཕོད་པ་ཡན་ལག་དམ་པ་དང་ལྡན་པ། གོ་ཆ་ལེགས་པར་བགོས་པ་སྲ་བའི་གོ་གྱོན་པ་བརྒྱད་ཁྲི་བཞི་སྟོང་གིས་ནི་ཡོངས་སུ་བསྲུངས།
en: Monks, Māyādevī now set forth, surrounded and protected by 84,000 richly ornamented horse-drawn chariots, 84,000 richly ornamented elephant-drawn chariots, and 84,000 brave, heroic, and handsome foot soldiers wearing excellent and solid armor.

source: ཤཱཀྱའི་བུ་མོ་སྟོང་ཕྲག་དྲུག་ཁྲིས་ནི་མདུན་དུ་བདར།
en: She was escorted by 60,000 Śākya maidens.

source: རྒྱལ་པོ་ཟས་གཙང་མའི་ཕུ་ནུའི་རིགས་སུ་སྐྱེས་པའི་ཤཱཀྱ་རྒན་པ་དང་། གཞོན་པ་དང་། བར་མ་བཞི་ཁྲིས་ནི་ཡོངས་སུ་བསྲུངས།
en: She was guarded by 40,000 elders, youths, and middle-aged men from King Śuddhodana’s Śākya clan.

source: རྒྱལ་པོ་ཟས་གཙང་མའི་སླས་གླུ་དང་རོལ་མོའི་དབྱངས་སྒྲ་ནི་བྱེད། ཁར་བའི་སིལ་ཁྲོལ་དང་། ཕེག་རྡོབ་སིལ་སྙན་དང་། གླུ་དབྱངས་ལེན་པ་དྲུག་ཁྲིས་ནི་ཀུན་ནས་བསྐོར།
en: She was also surrounded by 60,000 women from King Śuddhodana’s retinue, who sang songs and played music, bells, and cymbals.

source: ལྷའི་བུ་མོ་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་། ཀླུའི་བུ་མོ་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་། དྲི་ཟའི་བུ་མོ་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་། མི་འམ་ཅིའི་བུ་མོ་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་། ལྷ་མ་ཡིན་གྱི་བུ་མོ་བརྒྱད་ཁྲི་བཞི་སྟོང་བཀོད་པའི་རྒྱན་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པ་ཤ་སྟག་གླུ་དང་རོལ་མོའི་དབྱངས་སྒྲ་སྣ་ཚོགས་ཀྱིས་བསྔགས་པ་བརྗོད་པ། རྗེས་སུ་འབྲང་བས་འགྲོའོ།
en: Some 84,000 celestial maidens followed her, as did 84,000 nāga maidens, 84,000 gandharva maidens, 84,000 kinnara maidens, and 84,000 female demigods. All of them were lavishly ornamented and sang her praise in melodic voices accompanied by music.

source: །ལུམ་བི་ནིའི་ནགས་ཚལ་དེ་ཐམས་ཅད་ཀྱང་སྤོས་ཆུའི་ཆག་ཆག་གིས་བཏབ་ཅིང་ལྷའི་མེ་ཏོག་གིས་གཏོར་བར་གྱུར་ཏོ།
en: All of Lumbinī Grove was sprinkled with droplets of perfumed water and strewn with celestial flowers.

source: །ནགས་ཚལ་དམ་པ་དེའི་ནང་ན་ཤིང་ལྗོན་པ་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་དུས་ལ་མ་བབ་པར་ལོ་མ་དང་མེ་ཏོག་དང་འབྲས་བུ་སྐྱེད་པར་གྱུར་ཏོ།
en: Every tree in that perfect grove had leaves, flowers, and fruits, even though it was out of season.

source: །ནགས་ཚལ་དེ་ནི་ལྷ་རྣམས་ཀྱིས་ཀྱང་ལེགས་པར་བརྒྱན་པར་གྱུར་ཏེ།
en: Even the gods had done their best to decorate the forest.

source: འདི་ལྟ་སྟེ་དཔེར་ན། འདྲེས་པའི་ཚལ་ལྷ་རྣམས་ཀྱིས་ལེགས་པར་བརྒྱན་པ་བཞིན་ནོ།
en: They had, in fact, made it appear like the gods’ Miśraka Garden.

source: །དེ་ནས་ལྷ་མོ་སྒྱུ་འཕྲུལ་ལུམ་བི་ནིའི་ནགས་ཚལ་དུ་ཕྱིན་ནས་ཤིང་རྟ་དམ་པ་དེ་ལས་བབས་ཏེ།
en: When Māyādevī arrived at the Lumbinī Grove, she stepped down from her fine chariot.

source: མི་དང་ལྷའི་བུ་མོ་དག་གིས་ཡོངས་སུ་བསྐོར་ཅིང་། ཤིང་དྲུང་ནས་ནི་ཤིང་དྲུང་དག་ཏུ་འགྲོ།
en: As human and divine maidens encircled her, she wandered from tree to tree and from grove to grove.

source: ནགས་ཚལ་ནས་ནི་ནགས་ཚལ་དག་ཏུ་འཆག །ལྗོན་པ་ནས་ནི་ལྗོན་པ་དག་ལ་ལྟ་ཞིང་དེ་རིམ་གྱིས་ཤིང་རིན་པོ་ཆེ་ཆེན་པོ་མཆོག་དང་ཕུལ་དུ་བྱ་བ།
en: She looked among all the trees and eventually arrived beneath a very special and exquisite fig tree.

source: ཡལ་ག་ཤིན་ཏུ་རྣམ་པར་འབྱེས་པ། ལོ་མ་དང་དོག་པ་བཟང་པོ་དང་ལྡན་པ། མི་དང་ལྷའི་མེ་ཏོག་སྣ་ཚོགས་རབ་ཏུ་རྒྱས་པ།
en: Its branches spread out, full of lush leaves and clusters of blossoms, and further adorned with numerous flowers from the realms of both humans and gods.

source: སྤོས་མཆོག་དང་ཕུལ་དུ་བྱ་བའི་དྲིའི་ངད་དང་ལྡན་པའི་གོས་ཁ་དོག་སྣ་ཚོགས་སྤྱངས་པ།
en: Richly scented cloths of many colors were draped across its branches.

source: ནོར་བུ་དང་རིན་པོ་ཆེ་སྣ་ཚོགས་ལྟ་བུའི་འོད་རྣམ་པ་ཐ་དད་པ་འབར་བ།
en: It was sparkling with the light of many gems and jewels.

source: རྩ་བ་དང་། སྡོང་པོ་དང་། ཡལ་ག་དང་། ལོ་མ་རྣམས་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་ལེགས་པར་བརྒྱན་པ།
en: Its roots, trunk, branches, and leaves were all adorned with jewels.

source: ཡལ་ག་རིང་ཞིང་ཤིན་ཏུ་རྣམ་པར་འབྱེས་པ།
en: Its branches were long and spread out spaciously.

source: བླག་ཤ་ཞེས་བྱ་བ་སའི་ཕྱོགས་ལག་མཐིལ་ལྟར་མཉམ་ཞིང་ཤིན་ཏུ་བཟང་ལ་ཡངས་པ། རྩྭ་སྔོན་པོ་རྨ་བྱའི་མགྲིན་པ་ལྟ་བུ་སྐྱེས་པ།
en: The ground where the fig tree stood was smooth like the palm of a hand, beautiful and open, and it was full of dark blue grass, the color of a peacock’s neck.

source: ཀ་ཙ་ལིན་དིའི་གོས་ལྟར་རེག་ན་བདེ་བའི་ས་ལ་འདུག་པ།
en: The earth was pleasant to the touch, like soft kācilindika cloth.

source: སྔོན་གྱི་རྒྱལ་བའི་ཡུམ་གྱིས་བརྟེན་པ། ལྷའི་གླུ་དབྱངས་བླངས་པ།
en: This tree had supported the mothers of previous victorious ones, and it had been praised in the poetry of the gods.

source: གནས་གཙང་མའི་ལྷ་བཟང་ཞིང་དྲི་མ་མེད་ལ་རྣམ་པར་དག་པ་རབ་ཏུ་ཞི་བའི་སེམས་དང་ལྡན་པ་རྣམས་ཀྱིས་ཐོར་ཚུགས་དང་ཅོད་པན་མངོན་པར་བཏུད་པའི་སྤྱི་བོས་མངོན་པར་ཕྱག་བྱ་བའི་ཤིང་ལྗོན་པ་བླག་ཤ་དེའི་དྲུང་དུ་ཕྱིན་ཏོ།
en: It was a tree to which the wholesome and peaceful gods of the pure realms would bow down and touch with their heads, including their topknots and diadems. Now the queen and her retinue had arrived at this pure and stainless fig tree.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའི་གཟི་བརྗིད་དང་མཐུས་ཤིང་བླག་ཤ་དེས་མངོན་པར་བཏུད་དེ་ཕྱག་བྱས་སོ།
en: However, at this moment the Bodhisattva’s magnificence and power caused the fig tree itself to bow down and pay homage to him.

source: །དེ་ནས་ལྷ་མོ་སྒྱུ་འཕྲུལ་ནམ་མཁའི་དཀྱིལ་དུ་སྣང་བའི་གློག་གི་ཕྲེང་བ་ལྟ་བུའི་ལག་པ་གཡས་པ་བརྐྱང་ནས། བླག་ཤའི་ཡལ་ག་ལས་བཟུང་སྟེ།
en: Māyādevī stretched out her right arm, like a flash of lightning appearing in the middle of the sky, and grasped a branch of the tree.

source: ཚུལ་དུ་ཤིས་པར་ནམ་མཁའི་དཀྱིལ་དུ་བལྟས་ནས་བྱ་སྨྱངས་བྱེད་ཅིང་འདུག་པར་གྱུར་ཏོ།
en: She auspiciously directed her gaze into the open sky and stretched her body.

source: །དེ་ནས་དེའི་ཚེ་འདོད་པ་ན་སྤྱོད་པའི་ལྷའི་ནང་ནས་ལྷའི་བུ་མོ་དྲུག་ཁྲི་ལྷགས་ཏེ། ལྷ་མོ་སྒྱུ་འཕྲུལ་ལ་རིམ་གྲོ་དང་བཀུར་སྟི་བྱེད་པར་གྱུར་ཏོ།
en: At that point sixty thousand goddesses from the desire realm approached Māyādevī to assist and venerate her.

source: །བྱང་ཆུབ་སེམས་དཔའ་མའི་རུམ་ན་འདུག་པའི་ཚེ། རྣམ་པ་དེ་ལྟ་བུའི་རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་དང་ལྡན་པར་གནས་སོ།
en: Such were the miracles that occurred while the Bodhisattva was in his mother’s womb.

source: །དེ་ཟླ་བ་བཅུ་ཚང་ནས་མའི་གློ་གཡས་པ་ནས་དྲན་ཞིང་ཤེས་བཞིན་དུ་མངལ་གྱི་དྲི་མས་མ་གོས་པར་བྱུང་སྟེ།
en: Now, as the ten months had been completed, he emerged from his mother’s right side, fully aware and mindful.

source: གཞན་ལྟར་མ་ཡིན་ཞིང་གཞན་དག་ལ་མངལ་གྱི་དྲི་མ་ཞེས་བྱ་བ་བརྗོད་པ་དེ་ལྟ་བུ་མེད་པར་གྱུར་ཏོ།
en: In this way he was unstained by any impurities of the womb, which otherwise are said to stain everyone else.

source: །དགེ་སློང་དག་དེའི་ཚེ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་། མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་གཉིས་མདུན་ན་འཁོད་དེ།
en: Monks, at that time Śakra, lord of the gods, and Brahmā, lord of the Sahā World, appeared before the Bodhisattva.

source: དེ་གཉིས་ཀྱིས་རིམ་གྲོ་དམ་པ་ཆེན་པོས་ལྷའི་གོས་ཀ་ཤི་པའི་སླེབ་མོས་ལུས་དང་ཡན་ལག་ཐམས་ཅད་ཀྱིས་དྲན་ཞིང་ཤེས་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་བླངས་སོ།
en: As they remembered and recognized who he was, they were full of veneration for the Bodhisattva and wrapped him up in divine silk.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཁང་པ་བརྩེགས་པ་གང་གི་ནང་ན་འདུག་ཅིང་མའི་རུམ་ན་གནས་གནས་པ་དེ་ཡང་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་དང་། ཚངས་རིས་ཀྱི་ལྷ་རྣམས་ཀྱིས་ཚངས་པའི་འཇིག་རྟེན་དུ་གྱེན་དུ་བཏེག་སྟེ། མཆོད་རྟེན་དུ་བྱ་བ་དང་། མཆོད་པ་བྱ་བའི་ཕྱིར་ཁྱེར་རོ།
en: The temple in which the Bodhisattva had dwelt while in his mother’s womb was carried off by Brahmā, lord of the Sahā World, and the other gods of the Brahma realm up into their realm, where they enshrined the temple in a memorial and made it an object of worship.

source: །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་མིར་གྱུར་པ་གང་གིས་ཀྱང་མ་བླངས་ཀྱི། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ལྷ་རྣམས་ཀྱིས་བླངས་སོ།
en: Thus the Bodhisattva was first received by the gods rather than by any humans.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བཙས་མ་ཐག་ཏུ་ས་ལ་འབབ་སྟེ།
en: As soon as he was born, the Bodhisattva stepped onto the ground.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ས་ལ་བབས་པར་གྱུར་མ་ཐག་ཏུ་པད་མ་ཆེན་པོ་ཞིག་གིས་ས་འདི་ཡང་བརྟོལ་ཏེ་བྱུང་ངོ་།
en: Wherever his feet touched the ground, a large lotus immediately sprung from the earth.

source: །ཀླུའི་རྒྱལ་པོ་ཆེན་པོ་དགའ་བོ་དང་། ཉེ་དགའ་བོ་གཉིས་ཀྱང་ནམ་མཁའི་དཀྱིལ་ན་ལུས་ཕྱེད་ཕྱུང་སྟེ་འཁོད་ནས་བསིལ་བ་དང་། དྲོ་བའི་ཆུའི་རྒྱུན་གཉིས་མངོན་པར་སྤྲུལ་ནས་བྱང་ཆུབ་སེམས་དཔའི་ལུས་བཀྲུས་སོ།
en: Then the great nāga kings Nanda and Upananda revealed their upper bodies in the sky and produced two streams of cool and warm water to rinse the Bodhisattva’s body.

source: །བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་ལ་སོགས་པ་གཞན་ཡང་ལྷའི་བུ་བརྒྱ་སྟོང་མང་པོ་དག་བྱང་ཆུབ་སེམས་དཔའ་བཙས་མ་ཐག་ཏུ་སྤོས་ཆུ་སྣ་ཚོགས་དང་། མེ་ཏོག་སིལ་མས་ལུས་འཁྲུ་ཞིང་མངོན་པར་འཐོར་རོ།
en: Śakra, Brahmā, the guardians of the world, and many hundreds of thousands of gods then bathed the Bodhisattva in perfumed water and scattered flower petals over him.

source: །བར་སྣང་ལས་ཀྱང་རྡུལ་ཡབ་ཀྱི་རྔ་མ་གཉིས་དང་། རིན་པོ་ཆེའི་གདུགས་བྱུང་བར་གྱུར་ཏོ།
en: A parasol of precious gems and two yak-tail whisks also appeared from midair.

source: །དེ་པད་མ་ཆེན་པོ་དེ་ལ་འདུག་ནས་ཕྱོགས་བཞིར་རྣམ་པར་ལྟ་སྟེ། སེང་གེའི་ལྟ་སྟངས་དང་། སྐྱེས་བུ་ཆེན་པོའི་ལྟ་སྟངས་ཀྱིས་རྣམ་པར་ལྟའོ།
en: The Bodhisattva stood on a large lotus and surveyed the four directions with his lion’s gaze, the gaze of a great being.

source: །དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔས་སྔོན་གྱི་དགེ་བའི་རྩ་བའི་རྣམ་པར་སྨིན་པ་ལས་བྱུང་བ་ལྷའི་མིག་ཐོགས་པ་མེད་པས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་ཡུལ་འཁོར་དང་། ཕོ་བྲང་འཁོར་དང་། ལྗོངས་སུ་བཅས། ཡུལ་དུ་བཅས། མི་དང་ལྷར་བཅས་པ་རྣམས་མཐོང་བར་གྱུར་ཏོ།
en: At that time the Bodhisattva, with unhindered higher knowledge, which he manifested due to the ripening of previous roots of virtue, saw the entire great trichiliocosm. He saw all the cities, towns, estates, kingdoms, royal cities, and lands, as well as all gods and humans.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་སྤྱོད་པའང་རབ་ཏུ་ཤེས་ཏེ། ཤེས་ནས་ཀྱང་སེམས་ཅན་གང་ཚུལ་ཁྲིམས་སམ། ཏིང་ངེ་འཛིན་ཏམ། ཤེས་རབ་བམ། དགེ་བའི་སྤྱོད་པས་བདག་དང་འདྲ་བ་དེ་ལྟ་བུ་གང་ལ་ལ་ཞིག་ཡོད་དམ་ཞེས་རྣམ་པར་ལྟའོ།
en: He also perfectly knew the minds of all sentient beings and carefully surveyed them, looking to see if there was anyone similar to himself in terms of virtuous conduct, discipline, meditative absorption, or knowledge.

source: །དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་བདག་དང་མཚུངས་པའི་སེམས་ཅན་གང་ཡང་མ་མཐོང་ནས།
en: However, in the entire great trichiliocosm, the Bodhisattva did not see anyone like himself.

source: དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེང་གེ་ལྟར་འཇིགས་པ་མེད་ཅིང་བག་ཚ་བ་མེད་དེ།
en: At that point the Bodhisattva felt a lion-like fearlessness, free of anxiety or apprehension.

source: ཞུམ་པ་དང་བག་འཆུམས་པ་མེད་པས་ལེགས་པར་བསམ་པ་དྲན་པར་བྱས་ཏེ།
en: Without any hesitation or wavering, he reminded himself of his good motivations.

source: བསམས་བརྟགས་ནས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་སྤྱོད་པ་ཤེས་པར་བྱ་སྟེ།
en: Because he had examined the minds of all sentient beings, he now knew their thoughts.

source: སུས་ཀྱང་བསྟན་པ་མེད་པར་བྱང་ཆུབ་སེམས་དཔའ་དགེ་བའི་རྩ་བའི་ཆོས་ཐམས་ཅད་ཀྱི་སྔོན་དུ་འགྲོ་བར་བྱའོ་ཞེས་ཤར་ཕྱོགས་ལོགས་སུ་གོམ་པ་བདུན་བོར་རོ།
en: Unsupported, he took seven steps toward the east and declared, “I will be the cause of all virtuous practices.”

source: །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་གང་དང་གང་དུ་གོམ་པ་བོར་བ་དེ་དང་དེ་དག་ཏུ་པད་མ་དག་ཀྱང་སྐྱེས་པར་གྱུར་ཏོ།
en: Wherever the Bodhisattva took a step, a lotus sprouted forth.

source: །ལྷ་དང་མི་རྣམས་ཀྱི་སྦྱིན་པའི་གནས་སུ་འགྱུར་བར་བྱའོ་ཞེས་ལྷོ་ཕྱོགས་ལོགས་སུ་གོམ་པ་བདུན་བོར་རོ། །ནུབ་ཕྱོགས་ལོགས་སུ་གོམ་པ་བདུན་བོར་ནས་གོམ་པ་བདུན་པ་ལ་གནས་ཏེ་ང་ནི་འཇིག་རྟེན་ན་ཕུལ་དུ་ཕྱིན་པའོ།
en: He then took seven steps toward the south and said, “I am worthy of the offerings of gods and humans.” Next he took seven steps toward the west and, pausing on the seventh step, he proclaimed these satisfying words in lion-like fashion: “I am the Supreme Being on this earth.

source: །འདི་ནི་ངའི་སྐྱེ་བ་ཐ་མ་སྟེ། སྐྱེ་བ་དང་། རྒ་བ་དང་། ན་བ་དང་། འཆི་བ་མཐར་དབྱུང་ངོ་ཞེས་སེང་གེ་ལྟར་ཚིམ་པར་གྱུར་པའི་སྒྲ་བསྒྲགས་སོ། །སེམས་ཅན་ཐམས་ཅད་ཀྱི་ནང་ན་བླ་ན་མེད་པར་བྱའོ་ཞེས་བྱང་ཕྱོགས་ལོགས་སུ་གོམ་པ་བདུན་བོར་རོ། །བདུད་དང་བདུད་ཀྱི་སྡེ་ནི་གཞོམ་པར་བྱའོ།
en: This is my last birth, where I shall uproot birth, old age, sickness, and death!” He then took seven steps toward the north and said, “I will be supreme among all sentient beings!” Next he took seven steps downhill, saying, “I will subjugate Māra and his army!

source: །སེམས་ཅན་དམྱལ་བ་པ་ཐམས་ཅད་ཀྱི་སེམས་ཅན་དམྱལ་བའི་མེ་གསད་པའི་ཕྱིར་ཆོས་ཀྱི་ཆར་སྤྲིན་ཆེན་པོའི་ཆར་ཕབ་སྟེ། དེ་དག་བདེ་བས་ཚིམ་པར་བྱའོ་ཞེས་འོག་གི་ཕྱོགས་ལོགས་སུ་གོམ་པ་བདུན་བོར་རོ། །སེམས་ཅན་ཐམས་ཅད་ཀྱི་གྱེན་དུ་བལྟ་བར་འགྱུར་བར་བྱའོ་ཞེས་སྟེང་གི་ཕྱོགས་ལོགས་སུ་གོམ་པ་བདུན་བོར་ནས་སྟེང་དུ་ལྟའོ།
en: I will cause great rain clouds of the Dharma to shower down on all hell beings, extinguishing the fires of hell and filling the beings there with happiness.” Finally he took seven steps uphill, lifted his gaze, and said, “All sentient beings will look up to me.”

source: །བྱང་ཆུབ་སེམས་དཔས་ཚིག་དེ་བརྗོད་མ་ཐག་ཏུ་དེ་ནས་དེའི་ཚེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིར་སྒྲས་མངོན་པར་གོ་བར་གྱུར་ཏེ།
en: As the Bodhisattva spoke in this way, his words were immediately heard throughout the entire great trichiliocosm.

source: དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལས་བྱུང་བའི་མངོན་པར་ཤེས་པའི་ཆོས་ཉིད་དོ།
en: Such was the nature of the foreknowledge that sprang from the ripening of the Bodhisattva’s previous actions.

source: །གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སྲིད་པ་ཐ་མ་པ་བཙའ་བར་འགྱུར་བ་དང་། གང་གི་ཚེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་དེའི་ཚེ། རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་གྱི་རྣམ་པ་དེ་ལྟ་བུ་དེ་དག་བྱུང་ངོ་།
en: Whenever a bodhisattva takes birth into his final existence, and as he awakens to perfect and complete buddhahood, various miracles unfold.

source: །དགེ་སློང་དག་དེའི་ཚེ་སེམས་ཅན་ཐམས་ཅད་ཀྱང་རབ་ཏུ་དགའ་ཞིང་སྤུ་གཡོས་པར་གྱུར་ཏོ།
en: Monks, at that time all beings were so delighted that the hairs on their bodies shivered.

source: །འཇིག་རྟེན་དུ་ས་གཡོ་བ་ཆེན་པོ་ཤིན་ཏུ་འཇིགས་ཤིང་སྤུ་གཡོ་བར་འགྱུར་བ་ཡང་བྱུང་བར་གྱུར་ཏོ།
en: There was also a terrifying quaking of the earth, which caused the hairs on their bodies to stand on end.

source: །མི་དང་ལྷའི་སིལ་སྙན་དང་། རོལ་མོའི་དབྱངས་སྒྲར་བྱ་བ་ཐམས་ཅད་ཀྱང་མ་བླངས་པར་སྒྲ་འབྱིན་པར་གྱུར་ཏོ།
en: The cymbals and musical instruments of gods and humans sounded without being played by anyone.

source: །དེའི་ཚེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་དུས་དང་དུས་མཚམས་སོ་སོའི་ཤིང་ཐམས་ཅད་ཀྱང་མེ་ཏོག་རྒྱས་ཤིང་འབྲས་བུ་ཆགས་པ་དང་རྣམ་པར་དག་པར་གྱུར་ཏོ།
en: At that time all the trees in the great trichiliocosm—whether in season or not—blossomed and bore fruit.

source: །ནམ་མཁའི་དཀྱིལ་ནས་ཀྱང་སྤྲིན་གྱི་སྒྲ་གྲགས་ཏེ། སྤྲིན་མེད་པའི་ནམ་མཁའ་ལས་ཀྱང་དལ་བུས་དལ་བུས་ཕྲ་བ་ཕྲ་བའི་ཆར་ལྷ་ཡུལ་བའི་ཁ་དོག་དང་ལྡན་པའི་མེ་ཏོག་དང་། གོས་དང་། རྒྱན་དང་། སྤོས་ཀྱི་ཕྱེ་མ་དང་འདྲེས་པ་འབབ་པར་གྱུར་ཏོ།
en: From the expanse of pure space, the sound of thunder rang out, and from the cloudless sky, a fine mist of rain showered down ever so gently, mixed with divinely colored flowers, cloths, ornaments, and powdered incense.

source: །རླུང་རེག་ན་མཆོག་ཏུ་བདེ་བ་འཇམ་པ་དྲི་ཞིམ་པོ་དག་ཀྱང་ལྡང་བར་གྱུར་ཏོ།
en: Deliciously scented breezes blew, delightful and cooling.

source: །ཕྱོགས་ཐམས་ཅད་ཀྱང་མུན་པ་དང་། རྡུལ་དང་། དུ་བ་དང་། ཁུག་རྣ་མེད་ཅིང་རབ་ཏུ་དང་བས་རྣམ་པར་མཛེས་པར་གྱུར་ཏོ།
en: In all directions there was no darkness, dust, smoke, or mist to be seen, and everything appeared bright and beautiful.

source: །སྟེང་གི་བར་སྣང་ལས་ཀྱང་ཚངས་པའི་སྒྲ་ཆེན་པོ་སྙན་ཅིང་ཟབ་པ་གྲག་པར་གྱུར་ཏོ།
en: Also, from the empty space above, the great melodious and profound sounds of the realm of Brahmā were heard.

source: །ཉི་ཟླ་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བའི་འོད་ཐམས་ཅད་ཀྱང་ཟིལ་གྱིས་མནན་ཏེ། འོད་ཁ་དོག་བརྒྱ་སྟོང་དང་ལྡན་པ། རེག་ན་མཆོག་ཏུ་བདེ་བ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་དང་སེམས་ལ་བདེ་བ་སྐྱེད་པ། འཇིག་རྟེན་ལས་འདས་པ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་རྒྱས་པར་གང་བར་གྱུར་ཏོ།
en: All the light of the sun, the moon, Brahmā, Śakra, and the guardians of the world was eclipsed by an otherworldly light of a hundred thousand colors, which filled the entire great trichiliocosm and brought pleasure and happiness, both physical and mental, to everyone that it touched.

source: །བྱང་ཆུབ་སེམས་དཔའ་བཙས་མ་ཐག་ཏུ་སེམས་ཅན་ཐམས་ཅད་ཀྱང་བདེ་བས་ཤིན་ཏུ་ཚིམ་པར་གྱུར་ཏེ།
en: At the very moment when the Bodhisattva was born, all beings became filled with bliss.

source: འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་དང་། དྲེགས་པ་དང་། མི་དགའ་བ་དང་། ཞུམ་པ་དང་། འཇིགས་པ་དང་། ཆགས་པ་དང་། ཕྲག་དོག་དང་། སེར་སྣ་ཐམས་ཅད་དང་བྲལ་ཞིང་མི་དགེ་བའི་བྱ་བ་ཐམས་ཅད་སྤངས་པར་གྱུར་ཏོ།
en: All types of attachment, anger, delusion, pride, dislike, dejection, fear, greed, jealousy, and stinginess subsided, and everyone abandoned all forms of unwholesome conduct.

source: །སེམས་ཅན་ནད་པ་རྣམས་ཀྱི་ནད་ཀྱང་ཞི་བར་གྱུར་ཏོ།
en: The illnesses of the sick were cured.

source: །བཀྲེས་ཤིང་སྐོམ་པའི་སེམས་ཅན་རྣམས་ཀྱང་བཀྲེས་པ་དང་སྐོམ་པ་མེད་པར་གྱུར་ཏོ།
en: The hungry and the thirsty were relieved of their hunger and thirst.

source: །ཆང་གིས་ར་རོ་ཞིང་མྱོས་པ་རྣམས་ཀྱང་མྱོས་པ་མེད་པར་གྱུར་ཏོ།
en: The drunk and intoxicated were freed from their intoxication.

source: །སྨྱོས་པ་རྣམས་ཀྱང་དྲན་པ་ཐོབ་པར་གྱུར་ཏོ།
en: The mad had their sanity restored.

source: །མིག་མེད་པ་རྣམས་ཀྱིས་ཀྱང་མིག་ཐོབ་པར་གྱུར་ཏོ།
en: The blind could see.

source: །རྣ་བ་འོན་པ་རྣམས་ཀྱིས་ཀྱང་སྒྲ་ཐོས་པར་གྱུར་ཏོ།
en: The deaf could hear.

source: །ཡན་ལག་དང་ཉིང་ལག་ཉམས་པ་རྣམས་ཀྱང་དབང་པོ་ཉམས་པ་མེད་པར་གྱུར་ཏོ།
en: The crippled had their capacities restored.

source: །དབུལ་པོ་རྣམས་ཀྱིས་ཀྱང་ནོར་ཐོབ་པར་གྱུར་ཏོ།
en: The destitute gained wealth.

source: །བཙོན་ར་ན་འཁོད་པ་རྣམས་ཀྱང་བཙོན་ར་ནས་ཐར་བར་གྱུར་ཏོ།
en: The imprisoned were freed.

source: །མནར་མེད་པ་ལ་སོགས་པའི་སེམས་ཅན་དམྱལ་བ་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ནད་དུ་བྱ་བ་དང་སྡུག་བསྔལ་ཐམས་ཅད་དེའི་ཚེ་རྒྱུན་ཆད་པར་གྱུར་ཏོ།
en: All ailments and sufferings of those in the hell realms, starting with the Hell of Ultimate Torment, ceased at that moment.

source: །དུད་འགྲོའི་སྐྱེ་གནས་པ་རྣམས་ཀྱིས་གཅིག་ལ་གཅིག་ཟ་བ་ལ་སོགས་པའི་སྡུག་བསྔལ་ཡང་ཞི་བར་གྱུར་ཏོ།
en: The suffering of those born into the animal realm, such as the fear of being eaten by one another, was also pacified.

source: །གཤིན་རྗེའི་འཇིག་རྟེན་པའི་སེམས་ཅན་རྣམས་ཀྱི་བཀྲེས་པ་དང་སྐོམ་པ་ལ་སོགས་པའི་སྡུག་བསྔལ་ཡང་ཞི་བར་གྱུར་ཏོ།
en: Likewise the sufferings experienced by beings in the realm of the lord of death, such as hunger and thirst, were also pacified.

source: །གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གྲངས་མེད་པར་སྤྱད་པ་ཤིན་ཏུ་སྤྱད་པ། བརྩོན་འགྲུས་ཆེན་པོ་དང་ལྡན་པ། མཐུ་ཆེན་པོ་དང་ལྡན་པ།
en: The newborn Bodhisattva had already practiced good conduct for countless trillions of eons, and he possessed great diligence and strength.

source: བཙས་མ་ཐག་ཏུ་གོམ་པ་བདུན་འདོར་བའི་ཚེ་ཆོས་ཉིད་ཐོབ་པས་དེའི་ཚེ།
en: As such, when he took his first seven steps, he had already attained the state of reality.

source: ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ན་བཞུགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་སའི་ཕྱོགས་དེ་དེའི་ཚེ་ཞིག་པར་མི་འགྱུར་བར་བྱ་བའི་ཕྱིར་རྡོ་རྗེའི་རང་བཞིན་དུ་བྱིན་གྱིས་རློབ་པ་མཛད་དེ།
en: Therefore all the buddhas, the blessed ones, in all the realms in the ten directions blessed the earth at that spot of vajra nature so that it would not be destroyed by his steps.

source: དགེ་སློང་དག་དེ་ཙམ་དུ་སྟོབས་ཀྱི་ཤུགས་དྲག་པོ་དང་ལྡན་པར་བྱང་ཆུབ་སེམས་དཔའ་བཙས་མ་ཐག་པ་གོམ་པ་བདུན་འདོར་བར་གྱུར་ཏོ།
en: Monks, such was the awesome strength of the newborn Bodhisattva’s first seven steps.

source: །འཇིག་རྟེན་གྱི་བར་ཐམས་ཅད་ཀྱང་དེའི་ཚེ་སྣང་བ་ཆེན་པོས་རྒྱས་པར་གང་བར་གྱུར་ཏོ། །དེའི་ཚེ་གླུའི་སྒྲ་ཆེན་པོ་ཡང་བྱུང་བར་གྱུར་ཏེ། གར་གྱི་སྒྲ་ཆེན་པོ་ཡང་བྱུང་བར་གྱུར་ཏོ།
en: At that time the entire world was filled with a bright light, and the sounds of singing and dancing were heard.

source: །དེའི་ཚེ་མེ་ཏོག་དང་། ཕྱེ་མ་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། རིན་པོ་ཆེ་དང་། རྒྱན་དང་། གོས་ཀྱི་སྤྲིན་དཔག་ཏུ་མེད་པ་དག་ཀྱང་ཆར་དུ་མངོན་པར་བབ་པར་གྱུར་ཏོ།
en: A rain of flowers, powders, incense, garlands, jewels, ornaments, and cloths showered down from innumerable clouds.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱང་བདེ་བའི་མཆོག་དང་ལྡན་པར་གྱུར་ཏེ།
en: All beings were filled with perfect joy.

source: མདོར་ན་བྱང་ཆུབ་སེམས་དཔའ་འཇིག་རྟེན་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་པ་འཇིག་རྟེན་དུ་བྱུང་བའི་ཚེ། བྱ་བ་བསམ་གྱིས་མི་ཁྱབ་པ་བྱུང་བར་གྱུར་ཏོ།
en: In short, when the Bodhisattva, who is more exalted than anyone in all the worlds, came into this world, many inconceivable events took place.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: Venerable Ānanda now stood up from his seat, removed his robe from one shoulder, and kneeled, placing his right knee on the ground.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: He joined his palms in the direction of the Blessed One, bowed, and addressed these words to him:

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ནི་སེམས་ཅན་ཐམས་ཅད་ལས་ངོ་མཚར་དུ་གྱུར་པ་སྟེ།
en: “The Blessed One, the Thus-Gone One, is truly more amazing than anyone else.

source: བྱང་ཆུབ་སེམས་དཔའ་ཉིད་ཀྱང་རྨད་དུ་བྱུང་བའི་ཆོས་དང་ལྡན་པར་གྱུར་ན། ད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་ལྟ་སྨོས་ཀྱང་ཅི་འཚལ་ཏེ།
en: The Bodhisattva possessed incredible qualities, but how much more so the One Who Has Awakened to Perfect and Complete Buddhahood?

source: བཅོམ་ལྡན་འདས་འདི་ལྟར་བདག་ནི་ལན་བཞིའམ་ལན་ལྔར་ཡང་། ལན་བཅུར་ཡང་། ལན་ལྔ་བཅུའི་བར་དུ་ཡང་། ལན་བརྒྱའི་བར་དུ་ཡང་། ལན་བརྒྱ་སྟོང་དུ་མའི་བར་དུ་ཡང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་སྐྱབས་སུ་མཆིའོ།
en: O Blessed One, I therefore take refuge in Lord Buddha four times, five times, ten times, fifty times, a hundred times, or rather many hundreds of thousands of times!”

source: །དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: The Blessed One responded to these words from Ānanda by proclaiming:

source: །ཀུན་དགའ་བོ་མ་འོངས་པའི་དུས་ན་དགེ་སློང་ལ་ལ་ལུས་མ་བསྒོམས་པ། སེམས་མ་བསྒོམས་པ། ཚུལ་ཁྲིམས་མ་བསྒོམས་པ། ཤེས་རབ་མ་བསྒོམས་པ།
en: “In the future there will be some monks who do not train their bodies and minds and do not acquaint themselves with discipline and knowledge.

source: བྱིས་པ་མི་མཁས་པ། ལྷག་པའི་ང་རྒྱལ་ཅན། རྒོད་པ། ཁེངས་པ། མ་བསྡམས་པ། སེམས་གཡེངས་པ། ནེམ་ནུར་གྱིས་འཁོར་བ། ཐེ་ཚོམ་མང་བ། དད་པ་མེད་པ། དགེ་སྦྱོང་གི་དྲི་མར་གྱུར་པ། དགེ་སྦྱོང་གི་ཚུལ་དང་མི་འདྲ་བ་དག་འབྱུང་སྟེ།
en: Like unskilled children, they will be highly proud, wild, arrogant, unrestrained, distracted, hesitant, doubting, and without trust. They will bring stains on the monastic order and not live like proper monks.

source: དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་མའི་རུམ་དུ་འགྲོ་བ་ཡོངས་སུ་དག་པ་འདི་ལྟ་བུ་ཐོས་ནས་ཡིད་མི་ཆེས་ཤིང་དེ་དག་ཕྱོགས་གཅིག་ཏུ་ཚོགས་ནས་གཅིག་ལ་གཅིག་འདི་སྐད་དུ།
en: When they hear about the Bodhisattva entering his mother’s womb in such a pure way, they will not believe it.

source: ཀྱེ་ཁྱེད་ཅག་འདི་ལྟ་བུའི་མི་རིགས་པ་ལ་ལྟོས།
en: Instead they will gather and gossip, saying, ‘Listen, all of you, just listen to this nonsense!

source: བྱང་ཆུབ་སེམས་དཔའ་མའི་མངལ་ན་འདུག་པ་བཙོག་པའི་ཁུ་ཤུགས་དང་འདྲེས་པ་ལ་ཡང་འདི་ལྟ་བུའི་ལོངས་སྤྱོད་ཡོད་ཅེས་བྱ་བ་དང་། དེ་འབྱུང་བའི་ཚེ་མའི་གློ་གཡས་པ་ནས་མངལ་གྱི་དྲི་མས་མ་གོས་པར་བྱུང་ཞེས་བྱ་བ་འདི་རིགས་པར་ཇི་ལྟར་འགྱུར་ཞེས་ཟེར་བར་འགྱུར་ཏེ།
en: The Bodhisattva supposedly entered into his mother’s womb, where he mixed with impure fluids. And yet he is said to have had such enjoyments. Moreover, it is said that when he was born, he emerged from his mother’s right side without being sullied by any stains of the womb. But how could this be possible?’

source: སྐྱེས་བུ་གླེན་པ་དེ་དག་ནི་སེམས་ཅན་ལེགས་པར་བྱས་པའི་ལས་དང་ལྡན་པ་རྣམས་ཀྱི་ལུས་མི་གཙང་བའི་ཁུ་བའི་ནང་དུ་མི་འབྱུང་ངོ་ཞེས་བྱ་བར་མི་ཤེས་སོ།
en: “Such fools will not understand that the bodies of those who have engaged in excellent actions are not begotten from unclean fluids.

source: །དགེ་སློང་དག་སེམས་ཅན་དམ་པ་དེ་ལྟ་བུ་དག་གི་མངལ་དུ་འགྲོ་བ་དང་མངལ་ན་གནས་པ་ནི་ཤིན་ཏུ་ཡང་བཟང་བ་ཡིན་ནོ།
en: Monks, such sublime beings enter into and abide in the womb in the finest manner.
